[
    {
        "natural_language": "Hey! 😊 Espero que estés bien. Quería hacer un pedido, igual que la vez pasada que compré esos zapatitos chulos. Esta vez voy a necesitar unos 7 de esos Raspacallo freestyle anatómicos en foamy. Creo que estaban más o menos a 70 libras cada uno, o algo así. \n\nAh, y por favor mándalos a mi dirección en Humbert, con el código postal 71394. El lugar es 97, rue de Ramos... creo que es en Francia, ¿verdad? No te olvides de usar el envío estándar, pero me gustaría que llegaran antes del 29 de enero, si puedes. Pero bueno, si no se puede, no pasa nada, sólo quiero que lleguen bien y no este fin de semana, porfa.\n\nSi necesitas llamarme, puedes hacerlo al 9979150460, aunque a veces no respondo porque... ya sabes cómo es el trabajo, siempre ocupado. No dudes en escribirme al michael08@example.org o al otro correo, nrusso@example.org, por si acaso.\n\nGracias, ¡nos vemos! 🍀",
        "json_data": {
            "buyer": {
                "name": null,
                "email": "michael08@example.org",
                "contact": {
                    "phone": "9979150460",
                    "alt_email": "nrusso@example.org",
                    "preferred_contact": null
                },
                "addresses": [
                    {
                        "street": "97, rue de Ramos",
                        "city": "Humbert",
                        "state": null,
                        "postal_code": "71394",
                        "country": "FR"
                    }
                ]
            },
            "purchases": [
                {
                    "product_name": "Raspacallo freestyle anatómico en foamy",
                    "quantity": 7,
                    "currency": "GBP",
                    "discount_code": null
                }
            ],
            "shipping": {
                "method": "standard",
                "preferred_by": "2023-01-29T06:36:40"
            }
        }
    },
    {
        "natural_language": "¡Hola! 😊 Espero que estés bien. Te escribo porque necesito hacer un pedido de un par de cositas, como la vez pasada. \n\nVoy a necesitar unas 7 unidades de yogur suave 🍶. No estoy seguro de si pedí lo mismo la última vez, pero creo que fue algo parecido. También, me gustaría que incluyeras 4 limpiavidrios que sean dobles en su uso porque, la verdad, siempre viene bien tener un par extras en casa. Y, por último, quería pedir como unos 10 huevos, de esos jumbo rojos. 🥚\n\nPor cierto, lo voy a necesitar bastante pronto, tipo exprés, si es posible. Pero no creo que lo necesite para este fin de semana, así que tal vez podría llegar para el lunes o martes... eso sería genial. \n\nLa dirección de entrega es en Pons, en una calle que se llama 8, rue Valentine Lelièvre, 41563 en Francia. Si tienes alguna duda, mándame un mensaje al correo que te pasé antes, aunque prefiero que sea por teléfono, si te parece bien.\n\nGracias por tu ayuda, ¡espero tu respuesta! ¡Ah! Y siga lloviendo como ayer, ¿no? ☔️ Cuídame y hablamos pronto.",
        "json_data": {
            "buyer": {
                "name": null,
                "email": "vlewis@example.org",
                "contact": {
                    "phone": null,
                    "alt_email": null,
                    "preferred_contact": "phone"
                },
                "addresses": [
                    {
                        "street": "8, rue Valentine Lelièvre",
                        "city": "Pons",
                        "state": null,
                        "postal_code": "41563",
                        "country": "FR"
                    }
                ]
            },
            "purchases": [
                {
                    "product_name": "Yogurt sligth ",
                    "quantity": 7,
                    "currency": null,
                    "discount_code": null
                },
                {
                    "product_name": "Limpiavidrios doble uso new andin",
                    "quantity": 4,
                    "currency": null,
                    "discount_code": null
                },
                {
                    "product_name": "Huevo AA Jumbo Rojo ",
                    "quantity": 10,
                    "currency": "EUR",
                    "discount_code": null
                }
            ],
            "shipping": {
                "method": "express",
                "preferred_by": "2023-01-19T11:54:05"
            }
        }
    },
    {
        "natural_language": "Asunto: Pedido de productos\n\nHola,\n\nEspero que estés bien, ¡me imagino que has tenido una semana ocupada! Justo quería repasar el pedido que te hice antes, ¿te acuerdas de esos esmaltes tan bonitos? Bueno, me gustaría pedir algunas cositas adicionales. Así que, en total, creo que son alrededor de dos frascos de un esmalte específico, el Vogue fantastic en plata espejo, que me encantó la última vez que lo probé. Ojalá puedas hacerme llegar esas dos unidades, por favor. \n\nPor otra parte, también añadí algunas delicias; me refiero al chocolate Lindt Lindor, esos cornet que tienen un sabor único. Creo que la vez pasada pedí algunas por ahí, ¿serían unas 9 unidades más o menos? Son perfectos para compartir… o para no compartir 😄.\n\nMi dirección sigue siendo la misma, por si acaso: estoy en Urbanización de Inés Conesa 33, en Murcia, con el código postal 38730. \n\nPor cierto, ¿podrías enviarlo pronto? Pero no este fin de semana, tengo un par de cosas que hacer, así que mejor la próxima semana. Eso sí, te agradecería que me avises cuando lo envíes.\n\nAh, y sobre el precio, si no me equivoco, debería ser en dólares, o eso es lo que recuerdo. Espero no haberme olvidado de nada importante, si necesitas preguntar algo más, ya sabes dónde encontrarme.\n\n¡Gracias de antemano!\n\nSaludos,\nJohn Wolfe  \njohn.wolfe@gmail.com  ",
        "json_data": {
            "buyer": {
                "name": "John Wolfe",
                "email": "john.wolfe@gmail.com",
                "contact": null,
                "addresses": [
                    {
                        "street": "Urbanización de Inés Conesa 33",
                        "city": "Murcia",
                        "state": null,
                        "postal_code": "38730",
                        "country": "ES"
                    }
                ]
            },
            "purchases": [
                {
                    "product_name": "Esmalte Vogue fantastic plata espejo ",
                    "quantity": 2,
                    "currency": "USD",
                    "discount_code": null
                },
                {
                    "product_name": "Chocolate lindt lindor cornet ",
                    "quantity": 9,
                    "currency": null,
                    "discount_code": null
                }
            ],
            "shipping": null
        }
    },
    {
        "natural_language": "# Orden de Compra\n\n¡Hola! El otro día estaba pensando en lo mucho que me gustó el último pedido que hice. Ayer estuvimos hablando de lo que deberíamos comprar, especialmente algunos productos que disfrutamos mucho. En esta ocasión, nuevamente me decidí por algunas cositas interesantes.\n\n## Detalles del Comprador\n\nMi amigo, a quien le envié este pedido, se llama **Jorge Johnson**. Tiene un email que es jorge.johnson@hotmail.com. De repente, no tengo su número de contacto, y tampoco recuerdo si me pasó alguna dirección reciente. Pero bueno, eso no importa tanto, ¿verdad?\n\n## Productos Adquiridos\n\nHice algunas compras que espero que le gusten. La primera cosa que ordené fue más o menos **5** labiales de una marca que se llama Vogue, esos de color mate líquido, creo que son de 5 ml. La verdad, son super geniales para cualquier ocasión, ¡tienen unos colores espectaculares!\n\nPor otro lado, también incluí unas cuantas botellas de agua de coco natural de Adecoco, creo que pedí como aproximadamente **4**. Siempre es bueno mantenerse hidratado, especialmente cuando el clima está caluroso, ¡ya sabes! A veces pienso que debería comprar más, como la vez pasada que me quedé sin ellos demasiado rápido. \n\n## Envío\n\nSobre el envío, no estoy seguro si ya habían acordado algo, pero creo que no hay necesidad de hacer nada demasiado urgente, aunque... el tiempo sigue pasando. Quizás sería mejor que lleguen pronto, pero no este fin de semana, ya que tengo algunas cosas planeadas. \n\nAsí que eso es todo por ahora. Espero que todo llegue en buen estado y a tiempo. Hasta la próxima, ¡un saludo! 😊",
        "json_data": {
            "buyer": {
                "name": "Jorge Johnson",
                "email": "jorge.johnson@hotmail.com",
                "contact": null,
                "addresses": null
            },
            "purchases": [
                {
                    "product_name": "Labial Vogue Colorissimo karma mate líquido .x5ml",
                    "quantity": 5,
                    "currency": null,
                    "discount_code": null
                },
                {
                    "product_name": "Agua a de coco natural Adecoco ",
                    "quantity": 4,
                    "currency": null,
                    "discount_code": null
                }
            ],
            "shipping": null
        }
    },
    {
        "natural_language": "Asunto: Solicitud de Pedido\n\nHola,\n\nEspero que te encuentres bien. Te escribo porque estoy interesado en realizar un pedido, como la vez pasada. Me gustaría obtener unas seis unidades del producto Brillo Manteca de Karité Vitú Fresa. Por cierto, esa vez el producto me encantó, aunque un amigo me dijo que podría haberlo encontrado más barato, pero no me atrevo a cambiar de proveedor. La calidad de lo que vendes es de lo mejor, así que prefiero seguir contigo.\n\nEn cuanto al precio, he estado pensando que serían más o menos unas £10 por cada unidad, ¿recuerdas? Así que el total debería estar alrededor de £60… o algo así. \n\nAdemás, necesito que el envío sea rápido, casi como un exprés, si es posible, ya que me gustaría que llegara antes del 14 de enero, si no me equivoco. \n\nTe comparto las direcciones para la entrega, que son dos: una en Hoffmantown, 6636 Allen Manors (N9L2N9), y la otra es en East Stacytown, 4304 Rogers Extension (código postal A4V2E1). Este último lugar sería preferible si no hay inconvenientes. \n\nPor cierto, ayer llovió un montón aquí, así que espero que no esté afectando el transporte. Por favor, mándame la confirmación del pedido tan pronto como puedas, pero si puedes, no me lo envíes este fin de semana, ya que estoy un poco ocupado.\n\nAgradezco de antemano tu atención y quedo atento a tu respuesta.\n\nSaludos,\nJohn Gonzalez  \njohn.gonzalez@hotmail.com",
        "json_data": {
            "buyer": {
                "name": "John Gonzalez",
                "email": "john.gonzalez@hotmail.com",
                "contact": null,
                "addresses": [
                    {
                        "street": "6636 Allen Manors",
                        "city": "Hoffmantown",
                        "state": null,
                        "postal_code": "N9L2N9",
                        "country": "CA"
                    },
                    {
                        "street": "4304 Rogers Extension",
                        "city": "East Stacytown",
                        "state": null,
                        "postal_code": "A4V2E1",
                        "country": "CA"
                    }
                ]
            },
            "purchases": [
                {
                    "product_name": "Brillo Manteca de Karité Vitú Fresa",
                    "quantity": 6,
                    "currency": "GBP",
                    "discount_code": null
                }
            ],
            "shipping": {
                "method": "express",
                "preferred_by": "2023-01-14T12:08:25"
            }
        }
    },
    {
        "natural_language": "# Orden de Compra\n\n¡Hola! Espero que estés bien. Quería comentarte sobre mi reciente pedido, que es un poco especial, como hace unas semanas. La verdad es que no puedo resistirme a esos dulces que tanto me gustan. 😊  \n\n## Comprador\nLa información del comprador es la siguiente. Mi nombre es Katherine, por cierto, y te dejo mi correo para cualquier cosita: katherine_rowe@hotmail.com. Ah, y mi número de teléfono (no es el único, pero es el que prefiero) es el que empieza con \"001\" seguido de 3487606932. Por si necesitas hablar conmigo directamente, claro.  \n\n### Contacto Alternativo\nA veces suelo usar el email de un amigo, stevenberger@example.com, ya que le gusta ayudar con los pedidos.  \n\n## Direcciones\nRespecto a la dirección de envío, tengo dos lugares donde puedo recibir mis cosas:\n\n1. **Primera dirección:**\n   - Calle: 76, rue de Louis  \n   - Ciudad: Lenoir  \n   - Código postal: 85103  \n   - País: Francia 🇫🇷  \n\n2. **Segunda dirección:**\n   - Calle: Gerlachstraße 55  \n   - Ciudad: Quedlinburg  \n   - Código postal: 12374  \n   - País: Alemania 🇩🇪  \n\nElijo recibir aquí si es posible: un lugar algo acogedor.\n\n## Productos Comprados\nAhora, sobre lo que he pedido. Estoy emocionada, ¡son unas delicias! He solicitado, más o menos, **dos** panelitas blandas de leche de Dulces Del Valle. Tienes que probarlas, son lo mejor. 😋 En cuanto a los precios, ni idea, pero seguro son accesibles.  \n\n## Envío\nEl envío lo podemos hacer rápido, pero, te pido que no sea para este fin de semana, tengo algunos planes. Ayer llovió bastante, y me preocupaba que esto afectara las entregas, pero espero que todo esté bien. Solo un poco de consideración, por favor, ya sabes cómo me gusta.  \n\nEspero que todo esté claro. Esto es lo que tengo en mente, así que espero tu confirmación pronto. ¡Saludos!",
        "json_data": {
            "buyer": {
                "name": "Katherine Rowe",
                "email": "katherine_rowe@hotmail.com",
                "contact": {
                    "phone": "001-348-760-6932",
                    "alt_email": "stevenberger@example.com",
                    "preferred_contact": "phone"
                },
                "addresses": [
                    {
                        "street": "76, rue de Louis",
                        "city": "Lenoir",
                        "state": null,
                        "postal_code": "85103",
                        "country": "FR"
                    },
                    {
                        "street": "Gerlachstraße 55",
                        "city": "Quedlinburg",
                        "state": null,
                        "postal_code": "12374",
                        "country": "DE"
                    }
                ]
            },
            "purchases": [
                {
                    "product_name": "Panelita blanda de leche Dulces Del Valle ",
                    "quantity": 2,
                    "currency": null,
                    "discount_code": null
                }
            ],
            "shipping": null
        }
    },
    {
        "natural_language": "# Pedido de Compra de Janet\n\n¡Hola! Espero que todo esté genial por ahí. Quería comentarte sobre mi último pedido. Soy **Janet Brown**, y como te lo dije antes, prefiero a veces contactarme por teléfono 📞... aunque haya sido un poco complicado encontrar uno libre en casa. Te dejo el correo alternativo por si acaso: **zrichmond@example.net**.\n\nHablando de mi pedido, he decidido llevarme **nueve** unidades de una bolsa que me encantó: \"Rey Bolsa Condiachiote\". Me parece que quedan muy bien para mis cosas. El precio está bien, como a unas **£9** cada una, si no recuerdo mal. \n\nEn cuanto a la entrega, opté por el método **exprés**, porque a veces me gusta recibir mis cosas rápido, ya sabes, como la vez pasada que pedí y llegó casi al instante. Fue una experiencia bien chida! Pero, eh, ojo, no quiero que me lo envíen justo este fin de semana, ya que tendré visitas. Mejor que llegue en cualquier otro momento.\n\nCambiando de tema, en mi casa en Rochlitz, donde estoy ahora, la dirección es **Seifertgasse 6/5**, postal **84245**, en **Alemania**. Aunque también tengo otra dirección en Francia: **avenue Martel**, en la ciudad de **Gimenez**, con el código postal **53231**. A veces me confundo entre ambas, pero espero que no haya problema en esta ocasión.\n\nAyer llovió un montón y me quedé en casa disfrutando de un buen libro, pero también pienso en todas esas compras. Si tienes alguna pregunta sobre mi pedido, por favor, házmelo saber.\n\n¡Espero tu confirmación pronto! 😊 \n\nHasta luego.",
        "json_data": {
            "buyer": {
                "name": "Janet Brown",
                "email": "janet_brown@gmail.com",
                "contact": {
                    "phone": null,
                    "alt_email": "zrichmond@example.net",
                    "preferred_contact": "phone"
                },
                "addresses": [
                    {
                        "street": "Seifertgasse 6/5",
                        "city": "Rochlitz",
                        "state": null,
                        "postal_code": "84245",
                        "country": "DE"
                    },
                    {
                        "street": "avenue Martel",
                        "city": "Gimenez",
                        "state": null,
                        "postal_code": "53231",
                        "country": "FR"
                    }
                ]
            },
            "purchases": [
                {
                    "product_name": "Rey Bolsa Condiachiote ",
                    "quantity": 9,
                    "currency": "GBP",
                    "discount_code": null
                }
            ],
            "shipping": {
                "method": "express",
                "preferred_by": null
            }
        }
    },
    {
        "natural_language": "Hey, ¿cómo va todo? 😊\n\nTe escribo porque estoy pensando en hacer un pedido de cosas ricas. Me gustaría conseguir como 8 paquetes de la Sazonarey Chapeta, el de El Rey, que, por cierto, es buenísimo. Y ya que estamos, también quiero unas 8 botellas de esa cerveza Sol que me hiciste probar la otra vez, creo que son como unos €2 por botella... no estoy segura. \n\nAh, y lo voy a recoger yo mismo, no quiero que me lo envíes, así que cualquier cosa me avisas. \n\nPor cierto, tengo unas direcciones para que me mandes el pedido, así que no te preocupes. Uno es Cr. 12 # 1-46 Este en Sutatenza, Colombia (código 524260) y la otra sería en 78516 Duane Stravenue, West Laurafort, que es en Estados Unidos, aunque no sé si tienes alguna preferencia para enviarlo... 😅 \n\nEspero que esta vez no pase como la última vez que me tardé una eternidad en recibirlo. Hablamos pronto, y gracias de antemano. \n\nCuidate! 🥳",
        "json_data": {
            "buyer": {
                "name": null,
                "email": "fharris@example.net",
                "contact": {
                    "phone": "+1-487-213-6934",
                    "alt_email": null,
                    "preferred_contact": "email"
                },
                "addresses": [
                    {
                        "street": "Cr. 12 # 1-46 Este",
                        "city": "Sutatenza",
                        "state": null,
                        "postal_code": "524260",
                        "country": "CO"
                    },
                    {
                        "street": "78516 Duane Stravenue",
                        "city": "West Laurafort",
                        "state": "MH",
                        "postal_code": "82729",
                        "country": "US"
                    }
                ]
            },
            "purchases": [
                {
                    "product_name": "Sazonarey Chapeta 55g - El Rey",
                    "quantity": 8,
                    "currency": null,
                    "discount_code": null
                },
                {
                    "product_name": "Cerveza Sol botella ",
                    "quantity": 8,
                    "currency": "EUR",
                    "discount_code": null
                }
            ],
            "shipping": {
                "method": "pickup",
                "preferred_by": null
            }
        }
    },
    {
        "natural_language": "Asunto: Pedido de productos\n\nHola,\n\nEspero que te encuentres muy bien. Quería hacer un pedido que estoy pensando desde hace tiempo, más o menos como la vez pasada que pedí. Estoy un poco ocupada, pero seguro que no te va a costar mucho atender este pedido. \n\nPara comenzar, necesitaría una unidad de ese delicioso queso mozarella tajado de Alpina, que recuerdo estaba bien rico. Además, me gustaría agregar unas cuatro salchichas de perro caliente Zenú, que son las que me encantan. Me parece que la primera vez pedí algunas de esas, y fueron un éxito. \n\nPor cierto, en cuanto a la moneda, creo que el queso lo cotizaste en libras, así que no hay problema; y en cuanto a las salchichas, por lo que vi, sería en dólares, así que todo correcto. \n\nSi pudieras darme una idea de cómo iría la entrega, sería genial. No quiero que me lo envíes este fin de semana porque probablemente no estaré en casa, pero prefiero que sea pronto, por favor. Puedo ser contactada al número que ya tienes, (458) 567-6194, aunque si quieres, puedes enviarme un correo también a mi dirección, que es erika31@example.org. \n\nAh, y para no olvidarme, el clima hace unos días estuvo un poco raro, como que ayer llovió un montón, ¿verdad? Espero que eso no afecte el envío. \n\nGracias de antemano por tu ayuda. Hablamos pronto. \n\nUn saludo,  \nErika",
        "json_data": {
            "buyer": {
                "name": null,
                "email": "erika31@example.org",
                "contact": {
                    "phone": "(458)567-6194",
                    "alt_email": null,
                    "preferred_contact": "phone"
                },
                "addresses": null
            },
            "purchases": [
                {
                    "product_name": "Queso mozarella tajado Alpina ",
                    "quantity": 1,
                    "currency": "GBP",
                    "discount_code": null
                },
                {
                    "product_name": "Salchicha Perro Caliente Zenú ",
                    "quantity": 4,
                    "currency": "USD",
                    "discount_code": null
                }
            ],
            "shipping": null
        }
    },
    {
        "natural_language": "Asunto: Pedido de compra\n\nHola equipo,\n\nEspero que estén muy bien. Les escribo hoy desde una dirección que ya conocés, específicamente, en Casabianca, donde el código postal es el 882329, aunque también tengo una dirección en Alemania, en Backnang, que es Seidelring 54-35, por si necesitan enviarlo allí más adelante. \n\nAprovecho para hacer un pedido como el que hice el mes pasado, que llegó bien, gracias por eso. En esta ocasión, me gustaría solicitar unos artículos que no pueden faltar en mi casa. \n\nEn cuanto a los detalles, quiero pedir alrededor de 8 ambientadores, específicamente el de vainilla seducción, que es un must para mí. Ah, y no se me olvida el removedor de Vogue, pero esta vez necesito unas 10 unidades de ese, las que tienen sábila y caramidas, que son simplemente estupendas. \n\nSobre el tema de envíos, me gustaría que se organizara una recogida del pedido, no estoy muy apurado, pero si pudieran tenerlo listo para el 21 de enero sería perfecto. Tal vez no este fin de semana, ya que tengo algunos planes y no estoy seguro de poder coordinarlo en ese tiempo, pero mejor si lo tienen listo, ¿no? \n\nPor último, en términos de precios, debemos hablar de libras y euros, exactamente 8 libras para los ambientadores y en euros para los removedores, que suelen ser algo más caros, ¿verdad? \n\nSi necesitan algo más de mi parte, no duden en escribirme al email o también pueden usar el número +1-837-616-3654, aunque estoy más acostumbrado a mirar el correo.\n\nGracias mil por su atención y espero su respuesta pronto. \n\nUn gran saludo,  \nBryan Anderson  \nbryan_anderson@gmail.com",
        "json_data": {
            "buyer": {
                "name": "Bryan Anderson",
                "email": "bryan_anderson@gmail.com",
                "contact": {
                    "phone": "+1-837-616-3654",
                    "alt_email": "ttaylor@example.org",
                    "preferred_contact": null
                },
                "addresses": [
                    {
                        "street": "Carrera 80 # 3-1 Este",
                        "city": "Casabianca",
                        "state": null,
                        "postal_code": "882329",
                        "country": "CO"
                    },
                    {
                        "street": "Seidelring 54-35",
                        "city": "Backnang",
                        "state": null,
                        "postal_code": "70751",
                        "country": "DE"
                    }
                ]
            },
            "purchases": [
                {
                    "product_name": "Ambientador Bonaire vainilla seducción + repuesto ",
                    "quantity": 8,
                    "currency": "GBP",
                    "discount_code": null
                },
                {
                    "product_name": "Removedor Vogue sábila caramidas ",
                    "quantity": 10,
                    "currency": "EUR",
                    "discount_code": null
                }
            ],
            "shipping": {
                "method": "pickup",
                "preferred_by": "2023-01-21T06:46:06"
            }
        }
    },
    {
        "natural_language": "Hola! 😄 Espero que estés bien. Quería hacer un pedido de unas cosas ricas que me han gustado mucho. ¿Te acuerdas de mi anterior compra? Bueno, ahora quiero pedir más, un poquito diferente. \n\nPrimero, me gustaría que me mandes unos 10 yogures de colanta de fresa, me encantan! 🍓 Además, necesito un par de quesillos, creo que con 2 estaría bien. Y no puedo olvidarme de la crema de leche Nestlé en ese formato Doypack, más o menos unos 10 paquetitos de esos, pero en euros, porque me gusta más el precio 😅.\n\nAh, y sería genial si pudieras hacer el envío lo más rápido posible, tipo exprés, pero no me lo mandes este fin de semana, ya sabes cómo se pone todo 🥴. Estoy en Ashleystad, en la dirección 17857 Moore Unions Suite 783, GU 97650. Espero que no te compliques con eso.\n\nPor cierto, no sé si me darías un adelanto de cuánto saldría todo, pero como siempre, quiero lo mejor, supongo que un precio justo, no? 😂 Bueno, espero tu respuesta, cuídate! ✌️",
        "json_data": {
            "buyer": {
                "name": "Regina Daniels",
                "email": "regina_daniels@hotmail.com",
                "contact": {
                    "phone": null,
                    "alt_email": null,
                    "preferred_contact": null
                },
                "addresses": [
                    {
                        "street": "17857 Moore Unions Suite 783",
                        "city": "Ashleystad",
                        "state": "GU",
                        "postal_code": "97650",
                        "country": "US"
                    }
                ]
            },
            "purchases": [
                {
                    "product_name": "Yogur colanta griego fresa ",
                    "quantity": 10,
                    "currency": null,
                    "discount_code": null
                },
                {
                    "product_name": "Quesillo ",
                    "quantity": 2,
                    "currency": "USD",
                    "discount_code": null
                },
                {
                    "product_name": "Crema de Leche Nestlé Doypack ",
                    "quantity": 10,
                    "currency": "EUR",
                    "discount_code": null
                }
            ],
            "shipping": {
                "method": "express",
                "preferred_by": "2023-01-27T09:57:37"
            }
        }
    },
    {
        "natural_language": "Asunto: Pedido de productos\n\nHola,\n\nEspero que te encuentres muy bien. Estoy escribiendo para hacer un pedido que he estado considerando desde hace un tiempo. Como la vez pasada, creo que querré unos productos que me han encantado y que definitivamente necesito en mi hogar.\n\nPrimero que nada, estoy interesado en una unidad de la Mezcla de salsa boloñesa de Knorr, que es justo lo que me gusta para preparar esos platos. Ayer, de hecho, estaba pensando en ello mientras llovía aquí en New Jane, como en esos días nublados que invitan a una buena comida.\n\nAdemás, me gustaría pedir un total de diez botellas, o mejor dicho, unas diez, de leche de soya natural. Esta vez me gustaría que fueran en euros, como el pedido que hice anteriormente. Recuerdo que esas botellas son las que me mantienen despierto por las mañanas, ¡una maravilla! \n\nPor otro lado, he decidido agregar unos paños hogareños multiusos, algo que quizás haga falta. Pienso en cinco de ellos, tal como la promoción que dice “pague 6 lleve 12”, aunque en realidad solo necesito unos 5 para empezar. Pero no me malinterpretes, la oferta se ve atractiva, ¿no?\n\nEn cuanto al envío, sería genial si pudieras procesar esto como lo hiciste antes, con un método rápido, preferiblemente exprés, porque, la verdad, no puedo esperar a probar el nuevo sabor de la salsa.\n\nPor favor, mándenme el pedido a mi dirección. Es un poco complicado dar los detalles, pero estoy en 3 Murphy walks, en New Jane, con el código postal HD32 9XF, en Gran Bretaña. Ah, y también mi correo para cualquier seguimiento es ogarcia@example.org, aunque supongo que ya lo tienes.\n\nApreciaría que pudieran enviarlo pronto, pero no este fin de semana ya que tengo algunos planes. \n\nEspero tu respuesta. ¡Gracias de antemano!\n\nSaludos,  \nO García",
        "json_data": {
            "buyer": {
                "name": null,
                "email": "ogarcia@example.org",
                "contact": null,
                "addresses": [
                    {
                        "street": "3 Murphy walks",
                        "city": "New Jane",
                        "state": null,
                        "postal_code": "HD32 9XF",
                        "country": "GB"
                    }
                ]
            },
            "purchases": [
                {
                    "product_name": "Mezcla de salsa boloñesa Knorr ",
                    "quantity": 1,
                    "currency": "GBP",
                    "discount_code": null
                },
                {
                    "product_name": "Leche de soya natural ",
                    "quantity": 10,
                    "currency": "EUR",
                    "discount_code": null
                },
                {
                    "product_name": "Paño hogareño multiusos Eterna pague 6 lleve 12.",
                    "quantity": 5,
                    "currency": "EUR",
                    "discount_code": null
                }
            ],
            "shipping": {
                "method": "express",
                "preferred_by": null
            }
        }
    },
    {
        "natural_language": "Hola, ¿qué tal? 😊 Espero que todo esté bien por ahí. Quería hacer un pedido de algunas cosas que me encantan. La última vez que compré el yogur Deja Mu natural de frutos del bosque… me pareció que venía un montón, creo que eran como unas 9 tarrinas, están tan ricas que nunca son demasiadas, ¿no? \n\nTambién voy a necesitar un par de botellas de la ginebra Monkey 47, creo que 2 estaría bien. Ya sabes, para alguna reunión con amigos, que se viene el buen tiempo y hay que celebrarlo. 🍹\n\nPor cierto, deberías enviarlo a la Glorieta Juan Carlos Isern, que es donde estoy ahora, en Cantabria, el código postal es ese raro, el 32982. A veces pienso que debería irme a Guadalajara, donde también tengo un lugar, en la C. Adelaida Tomás, aunque el cp ahí es 04613. Pero en fin, mejor este pedido a mi dirección actual.\n\nSi pudieras hacerlo pronto, sería genial, pero no este fin de semana, ya sabes que a veces las cosas se complican. Y el precio, que creo era en euros, algo así como 9 por el yogur y un precio decente por la ginebra, no me acuerdo la cantidad exacta, pero seguro puedes verlo. \n\nAh, y si necesitas contactarme, puedes hacerlo al 001-587-226-4574, es un teléfono un poco raro, ja, ja. También tengo un correo, es alison_martinez@hotmail.com, pero a veces se me llena de spam, así que mejor llámame. \n\nGracias mil, ¡hablamos pronto! 😄",
        "json_data": {
            "buyer": {
                "name": "Alison Martinez",
                "email": "alison_martinez@hotmail.com",
                "contact": {
                    "phone": "001-587-226-4574x959",
                    "alt_email": "jessicahoward@example.net",
                    "preferred_contact": null
                },
                "addresses": [
                    {
                        "street": "Glorieta Juan Carlos Isern 533",
                        "city": "Cantabria",
                        "state": null,
                        "postal_code": "32982",
                        "country": "ES"
                    },
                    {
                        "street": "C. Adelaida Tomás 56",
                        "city": "Guadalajara",
                        "state": null,
                        "postal_code": "04613",
                        "country": "ES"
                    }
                ]
            },
            "purchases": [
                {
                    "product_name": "Yoghurt Deja Mu natural frutos bosque ",
                    "quantity": 9,
                    "currency": "EUR",
                    "discount_code": null
                },
                {
                    "product_name": "Ginebra Monkey 47 ",
                    "quantity": 2,
                    "currency": "EUR",
                    "discount_code": null
                }
            ],
            "shipping": null
        }
    },
    {
        "natural_language": "Asunto: Consulta sobre pedido\n\nEstimado proveedor,\n\nEspero que se encuentren muy bien. Mi nombre es [nombre del cliente], y me gustaría hacer una consulta rápida respecto a algunos productos que estoy interesado en adquirir. Hace un par de días, estuve revisando algunas opciones y creo que sería adecuado repetir un pedido similar al que hice anteriormente. \n\nEn concreto, tengo interés en unos productos de limpieza que son bastante buenos, en especial el Clorox que deja los blancos súper intensos. Estoy pensando en pedir más o menos una unidad de ese producto para probar si el resultado es el mismo que la última vez. Sería genial si pudieran gestionarlo.\n\nAdemás, les agradecería si pudieran enviarlo a tres direcciones diferentes, como hicimos antes. La primera es en España: Plaza de Pastor Solano, número 166, en la ciudad de Murcia, con el código postal 22957. También necesitaría que envíen algo a Colombia, específicamente a la Calle 143 Bis V # 34-63 Este en Tocancipá, con el código 547434. Y la última dirección es Urbanización Eutimio Tudela 45, en Zaragoza, España, código postal 35063. \n\nPor favor, no se preocupen demasiado por el envío, solo que llegue bien. Si pudiera ser un envío exprés, sería perfecto, pero tampoco quiero que lo envíen durante este fin de semana porque tengo otros compromisos. Si cuentan con algún descuento, sería también un placer aplicar eso, aunque no sé si había alguno vigente en este momento.\n\nAyer, hablamos sobre el clima y estaba lloviendo, así que espero que no haya retrasos en el transporte. Si tienen algún comentario o necesitan más información, no duden en decírmelo. Espero su pronta respuesta.\n\nSaludos cordiales,\n\n[nombre del cliente]  \n[email del cliente]  \n[número de contacto del cliente]",
        "json_data": {
            "buyer": {
                "name": null,
                "email": null,
                "contact": null,
                "addresses": [
                    {
                        "street": "Plaza de Pastor Solano 166",
                        "city": "Murcia",
                        "state": null,
                        "postal_code": "22957",
                        "country": "ES"
                    },
                    {
                        "street": "Calle 143 Bis V # 34-63 Este",
                        "city": "Tocancipá",
                        "state": null,
                        "postal_code": "547434",
                        "country": "CO"
                    },
                    {
                        "street": "Urbanización Eutimio Tudela 45",
                        "city": "Zaragoza",
                        "state": null,
                        "postal_code": "35063",
                        "country": "ES"
                    }
                ]
            },
            "purchases": [
                {
                    "product_name": "Clorox Blancos Intensos ",
                    "quantity": 1,
                    "currency": null,
                    "discount_code": null
                }
            ],
            "shipping": null
        }
    },
    {
        "natural_language": "Asunto: Pedido de Sorrentinos\n\nHola,\n\nEspero que te encuentres bien. Quería hacer un pedido similar al de la última vez que hice, en especial porque me acordé de lo deliciosos que son. En esta ocasión, estoy interesada en comprar unos seis paquetitos de los sorrentinos Avanti de ricotta y espinaca. La verdad es que son un manjar, ¡no hay nada como ellos! \n\nDicho esto, me gustaría que la entrega se gestionara por medio del servicio estándar, ya que, bueno, no tengo prisa. Sería genial si el pedido pudiera estar aquí, más o menos, para el 2 de enero, si todo marcha bien. \n\nPor cierto, te comparto mis direcciones de envío, solo por si acaso: puedes enviar el paquete a mi casa en Callejón de Nayara Tena 57, en Albacete, o si prefieres, a la otra que tengo en Via Paulina Atienza 146, en Zamora. Cualquiera de las dos me viene bien. \n\nAh, y no te olvides, que me gustaría que el paquete llegara sin problemas; como la última vez, no quiero tener sorpresas desagradables. Si hay algún código o algo así que pueda ayudar con el pedido, por favor, házmelo saber.\n\nGracias de antemano por tu ayuda. ¡Espero tu respuesta pronto!\n\nUn saludo,\n\nKelly Rodriguez  \nkelly.rodriguez@gmail.com  ",
        "json_data": {
            "buyer": {
                "name": "Kelly Rodriguez",
                "email": "kelly.rodriguez@gmail.com",
                "contact": null,
                "addresses": [
                    {
                        "street": "Callejón de Nayara Tena 57",
                        "city": "Albacete",
                        "state": null,
                        "postal_code": "02899",
                        "country": "ES"
                    },
                    {
                        "street": "Via Paulina Atienza 146",
                        "city": "Zamora",
                        "state": null,
                        "postal_code": "43832",
                        "country": "ES"
                    }
                ]
            },
            "purchases": [
                {
                    "product_name": "Sorrentinos Avanti ricotta espinaca ",
                    "quantity": 6,
                    "currency": null,
                    "discount_code": null
                }
            ],
            "shipping": {
                "method": "standard",
                "preferred_by": "2023-01-02T16:46:15"
            }
        }
    }
]